---
kind: property
id: P:Autodesk.Revit.DB.CylindricalHelix.XVector
source: html/cf831523-4e0d-1793-9163-06da91c0ac01.htm
---
# Autodesk.Revit.DB.CylindricalHelix.XVector Property

The X direction vector.

## Syntax (C#)
```csharp
public XYZ XVector { get; }
```